package homework;

public class OxQuiz {
	/*
	 * 문제 {"O", "O", "X", "X", "O", "X", "X", "O", "O", "O"}와 같은 OX퀴즈의 결과가 배열에 저장되어
	 * 있다. O는 문제를 맞은 것이고, X는 문제를 틀린 것이다. 문제를 맞은 경우 그 문제의 점수는 그 문제까지 연속된 O의 갯수가 된다.
	 * 
	 * 위의 예에서 {"O", "O", "X", "X", "O", "X", "X", "O", "O", "O"} OX퀴즈의 결과는 1 + 2 + 0
	 * + 0 + 1 + 0 + 0 + 1 + 2 + 3 = 10점이다.
	 * 
	 * OX퀴즈의 결과가 주어졌을 때 점수를 구하는 프로그램을 작성하시오.
	 */

	
	/*
	 * 내 풀이
	 * 
	 * 
	 * 주어지는 정보 1. OX퀴즈 문항수 2. OX퀴즈 결과
	 * 
	 * [1] 점수 계산하는 객체
	 * 
	 * 계산해야 할 것 1. 연속해서 맞힌 개수를 계산하여 각 항의 점수 구하기 2. 모든 항의 점수를 더해서 총점 구하기
	 * 
	 * ============================
	 * 
	 * [2] 결과값 배열을 받아오는 객체 만들기
	 * 
	 * 
	 * OX퀴즈 결과 저장할 배열 만들기 String[] 결과값들 = new String[OX퀴즈 문항수];
	 * 
	 * 반복문으로 배열에 결과 저장 결과값들[i] = 결과;
	 * 
	 * 
	 * 
	 */
}
